/* Localizable strings not stored in nib files shared by app and its plugins */

/* General strings */

"kMainPanelWindowName" = "Server Admin";

"kMainPanelAltWindowName" = "Server Admin: %@: %@";

"kServiceFilterMenuTitle" = "Service";

"kDeviceFilterMenuTitle" = "Computer";

"kAnyFilterMenuTitle" = "Any";

"kLocalServerEntryName" = "Local Directories";

"kShowLocalServicesMenu" = "Show Local Directories";

"kHideLocalServicesMenu" = "Hide Local Directories";

"kShowDSUGRecordBrowserDrawerMenu" = "Show Users & Groups";

"kHideDSUGRecordBrowserDrawerMenu" = "Hide Users & Groups";

"kShowRemoteFileBrowserDrawerMenu" = "Show Files and Directories";

"kHideRemoteFileBrowserDrawerMenu" = "Hide Files and Directories";

"kReconnectMenu" = "Connect…";

"kDisconnectMenu" = "Disconnect";

"kShowContentsViewMenu" = "Hide Summary"; /* Deprecated in Leopard */

"kHideContentsViewMenu" = "Show Summary"; /* Deprecated in Leopard */

"kDSUGRecordDownloadingNumberFormat" = "Fetching up to %d records…";

"kDSUGRecordDownloadedNumberFormat" = "Number of records: %d";

"kDSUGRecordMoreDownloadedNumberFormat" = "Number of records: %d+";

"kDSUGRecordDownloadedTimeFormat" = "Last download: %0.3f secs";

"kDSUGRecordDownloadingNotSupported" = "Users and Groups list not available in 10.2 server";

"kDSUGRecordNameFormat1" = "Short names: %@";

"kDSUGRecordNameFormat2" = "Short name: %@";

"kDSUGRecordPrimaryGroupIDFormat" = "Primary group ID: %d";

"kDSUGLocationPrefixFormat" = "At: %@";

"kFileBrowserDownloadingNotSupported" = "File Browser not available in 10.2 server";

"kLoadingDSUGRecord" = "Loading…";

"kLoadingRFBNode" = "Loading…";

"kStartServiceMenu" = "Start Service";

"kStopServiceMenu" = "Stop Service";

"kServiceFilterClearMenuItem" = "All Services";

"kServiceFilterActiveOnlyMenuItem" = "Hide Inactive";

"kInitialUsernamePassword" = "admin";

"kErrorCode" = "Error: ";

"kOK" = "OK";

"kEllipses" = "…";

"kAbbreviatedDay" = "d ";

"kAbbreviatedHour" = "h ";

"kAbbreviatedMin" = "m";

"kTimeSeparator" = ":";

"kLongDateFormatSingle" = "%d day, %d:%0.2d";

"kLongDateFormatMultiple" = "%d days, %d:%0.2d";

"kCurrentTime" = "Current";

"kNSLRegisteredName" = "Server Manager Daemons,servermgr";

"kNSLServiceDisplayName" = "Server Manager Service";

"kClearConnectRecentMenuItems" = "Clear Menu";

"kClearLogViewMenuItemTitle" = "Clear View";

"kClearEntriesMenuItemTitle" = "Clear Entries";

"kBytes" = "bytes";

"kAbbreviatedBytes" = "B";

"kPerSecond" = "/second";

"kAbbreviatedPerSecond" = "/sec";

"x10^-9" = "n";

"x10^-6" = "µ";

"x10^-3" = "m";

"x10^0" = "";

"x10^3" = "K";

"x10^6" = "M";

"x10^9" = "G";

"x10^12" = "T";

"kNoRecordMessage" = "no record selected";

"kReadOnlyDSDomain" = " domain is read only";

"kReadWriteDSDomain" = " domain is read/write";

"kReadConfigurationError" = "Error while reading settings";

"kWriteConfigurationError" = "Error while writing settings";

"kWriteConfigurationInProgressFormat" = "Writing settings… %0.1f%% done";

"kShowConfigRecordsButton" = "Record…";

"kHideConfigRecordsButton" = "Close";

"kShowUGRecordsButton" = "Users & Groups";

"kHideUGRecordsButton" = "Users & Groups";

"kShowRemoteFilesButton" = "Files…";

"kHideRemoteFilesButton" = "Close";

"kConfigurationFileName" = "Config";

"kConfigurationFileExtension" = "plist";

"kKeychainShouldBeLocked" = "Make sure your Keychain is locked when using this feature.";

"kNoTabViewHelpMessage" = "Select a service in the list of Computers & Services";

"kNewGroupDefaultName" = "New Group";

"kScannerEntryDefaultName" = "Available Servers";

"kUninstalledScannerEntryDefaultName" = "Ready for Install";

"kUnconfiguredScannerEntryDefaultName" = "Ready for Setup";

"kLibraryEntryDefaultName" = "Servers";

"kGroupsEntryDefaultName" = "Groups";

"kSmartGroupsEntryDefaultName" = "Smart Groups";

"kServiceAliasDisplayFormat" = " (%@)";

"kEmptyLog" = "Empty Log";

"kConfigurationDragAnchorToolTip" = "Drag and drop configuration to another window or to desktop";

"kScannerBrowserSingularStatusFormat" =  "Total: %d server";

"kScannerBrowserPlurialStatusFormat" =  "Total: %d servers";

"kOverview" = "Overview";

"kGroup" = "Group";

"kServer" = "Server";

"kService" = "Service";

"kPanel" = "Panel";

"kFirstUntitledGroup" = "untitled group";

"kNthUntitledGroupFormat" = "untitled group %d";

"kUntitledFolder" = "Untitled Folder";

"kNewGroupMenuItem" = "Add Group…";

"kGroupNameFormat" ="%@ (%d)";

"kSpaceAndOpenPeren" = " (";

"kClosePeren" = ")";
			
"kNewSmartGroupMenuItem" = "Add Smart Group…";
			
"kDeleteGroupMenuItem" = "Delete Group";

"kConfigureServicesMenuItem" = "Add Service…";

"kSSHToServerMenuItem" = "Connect to Server with SSH…";

"kCPUSummaryToolTip" = "Avg. CPU % per minute:";

"kCPUSummaryToolTipIntervalEntryFormat" = "\n%d:\t%d%%";

"kDiskSpaceSummaryToolTip" = "Disk space used per volume:";

"kDiskSpaceSummaryToolTipIntervalEntryFormat" = "\n%@ -\t %@ of %@ used (%d%%)";

"kDiskSpaceSummaryToolTipEntryFormat" = "%@  %@ of %@ used (%d%%)";

"kNetworkThroughputSummaryFormat" = "%@/sec";

"kDragUsers" = "Drag users to select";
		
"kDragGroups" = "Drag groups to select";
		
/* General strings shared by plugins */

"kStringNotAvailable" = "Not available";

"kTextNotAvailable" = "Data not available";

"kDateNotAvailable" = "Date and time not available";

"kBlankString" = "Unspecified";

"kPercentSymbol" = "%";

/* Toolbar items with their tool tip */

"NewConnectToolbarItem" = "Add Server…";
"NewConnectShortcut.tiff" = "Add a new server to the list";

"ReconnectToolbarItem" = "Connect";
"ReconnectShortcut.tiff" = "Connect selected server";

"DisconnectToolbarItem" = "Disconnect";
"DisconnectShortcut.tiff" = "Disconnect selected server";

"ShareScreenToolbarItem" = "Share Server's Screen…";

"DeleteToolbarItem" = "Remove Server";
"DeleteShortcut.tiff" = "Remove selected server from the list";

"RefreshToolbarItem" = "Refresh";
"RefreshShortcut.tiff" = "Update the status display";

"PreferencesToolbarItem" = "Prefs";
"PreferencesShortcut.tiff" = "Show Preferences panel";

"NewViewForDocumentToolbarItem" = "New Window";
"NewViewForDocumentShortcut.tiff" = "Create a new view";

"StopToolbarItem" = "Stop";
"StopShortcut.tiff" = "Stop refreshing services currently being refreshed";

"GoToThisAppToolbarItem" = "Status";
"GoToThisShortcut.tiff" = "Server Admin, you are already there!";

"GoToWorkgroupManagerAppToolbarItem" = "Workgroup Manager";
"GoToWorkgroupManagerShortcut.tiff" = "Go to Workgroup Manager";

"GoToAccountsViewOfWorkgroupManagerAppToolbarItem" = "Accounts";
"GoToAccountsWorkgroupManagerShortcut.tiff" = "Go to Workgroup Manager Accounts";

"GoToPreferencesViewOfWorkgroupManagerAppToolbarItem" = "Preferences";
"GoToPreferencesWorkgroupManagerShortcut.tiff" = "Go to Workgroup Manager Preferences";

"GoToSharingViewOfWorkgroupManagerAppToolbarItem" = "Sharing";
"GoToSharingWorkgroupManagerShortcut.tiff" = "Go to Workgroup Manager Sharing";

"GoToServerMonitorAppToolbarItem" = "Server Monitor";
"GoToServerMonitorShortcut.tiff" = "Go to Server Monitor";

"StartServiceToolbarItem" = "Start Service";
"StartServiceShortcut.tiff" = "Start selected service";

"StopServiceToolbarItem" = "Stop Service";
"StopServiceShortcut.tiff" = "Stop selected service";

"ShowContentsViewToolbarItem" = "Hide Summary"; /* Deprecated in Leopard */
"ShowContentsViewShortcut.tiff" = "Hide Summary view"; /* Deprecated in Leopard */

"HideContentsViewToolbarItem" = "Show Summary"; /* Deprecated in Leopard */
"HideContentsViewShortcut.tiff" = "Show Summary view"; /* Deprecated in Leopard */

"UGRecordBrowserToolbarItem" = "Users and Groups";
"UGRecordBrowserShortcut.tiff" = "Users and Groups drawer";

"SearchFieldToolbarItem" = "Search";
"SearchFieldShortcut.tiff" = "Search";


/* Keys comming from Server Manager Daemon plugin modules: errors */

"UNEXPECTED_COMMAND" = "The service did not recognize the command";

"NOT_ENOUGH_PRIVS_ERR" = "Insufficient privileges";

"CANNOT_MALLOC_ERR" = "Cannot allocate memory";

"FILE_NOT_FOUND_ERR" = "File not found, the service may not have logging enabled";

"CANNOT_FSEEK_ERR" = "Cannot seek into file";

"CANNOT_FREAD_ERR" = "Cannot read file";

"CANNOT_FRENAME_ERR" = "Cannot rename file";

"CANNOT_MAKE_HISTORY_ERR" = "Cannot update history data";

"CANNOT_GET_HISTORY_ERR" = "There is no history data";

"CANNOT_COMPRESS_HISTORY_ERR" = "Cannot compress history data";

"CANNOT_REDUCE_HISTORY_ERR" = "Cannot reduce history data";

"CANNOT_STAT_ERR" = "Cannot access file";

"SETTING_NOT_FOUND_ERR" = "Setting not found";

"SERVICE_NOT_RUNNING_ERR" = "Feature not available: service is not running";

"INVALID_ARG_ERR" = "Invalid argument";

"CANNOT_OPEN_DS_ERR" = "Cannot access DirectoryServices";

"CANNOT_OPEN_DS_NODE_ERR" = "Cannot open DirectoryServices node";

"CANNOT_ACCESS_PROCS_ERR" = "Cannot access process list";

"CANNOT_SIGNAL_PROCESS_ERR" = "Cannot signal process";

"CANNOT_NDCSTAT_ERR" = "Cannot access statistics: DNS service may not be running or not properly configured";

"CANNOT_ACCESS_STATS_ERR" = "Cannot read statistics: DNS service may not be running or not properly configured";

"CANNOT_PARSE_XML_REQUEST_ERR" = "Cannot parse XML request";

"CANNOT_PARSE_XML_RESPONSE_ERR" = "Cannot parse XML response";

"CANNOT_CREATE_XML_RESPONSE_ERR" = "Cannot create XML response"; 

"INVALID_SESSION_ERR" = "Invalid or expired session ID (you must reconnect)";

"CANNOT_LOAD_BUNDLE_ERR" = "Cannot load back-end component (bundle)";

"CANNOT_RUN_BUNDLE_ERR" = "Cannot execute back-end component (bundle)";

"OBJECT_EXIST_ERR" = "Object already exits";


/* Error sheets or alerts */

"kUnreachableServerDuringLoginTtl" = "Could not connect to %@.";

"kUnreachableServerDuringLoginMsg1" = "Server Admin was unable to connect to the server at %@. Disabling the “Require valid digital signature” preference may resolve this problem.";

"kUnreachableServerDuringLoginMsg2" = "Server Admin was unable to connect to the server at %@.";

"kUnreachableServiceDuringLoginTtl" = "There is no service available at the address you entered.";

"kUnreachableServiceDuringLoginMsg1" = "The service failed to access the address you provided for %@. Check the address and try to log on again. You may also try to disable the “Require valid digital signature” preference.";

"kUnreachableServiceDuringLoginMsg2" = "The service failed to access the address you provided for %@. Check the address and try to log on again.";

"kServerAuthenticationFailureDuringLoginTtl" = "The login information is incomplete for this server or is not valid.";

"kServerAuthenticationFailureDuringLoginMsg" = "The server failed to accept the login information you provided for %@. Check the Name and Password and try to log on again.";

"kServiceAuthenticationFailureDuringLoginTtl" = "The login information is incomplete for this service or is not valid.";

"kServiceAuthenticationFailureDuringLoginMsg" = "The service failed to accept the login information you provided for %@. Check the Name and Password and try to log on again.";

"kUnreachableServerTtl" = "The server is unreachable";

"kUnreachableServerMsg1" = "Try to reconnect to %@. You may also try to disable the “Require valid digital signature” preference.";

"kUnreachableServerMsg2" = "Try to reconnect to %@.";

"kUnreachableServiceTtl" = "The service \"%@\" is unreachable";

"kUnreachableServiceMsg1" = "Try to reconnect to %@ (a back-end component may be missing).";

"kUnreachableServiceMsg2" = "Try to reconnect to %@ (a back-end component may be missing).";

"kServiceAuthenticationFailureTtl" = "The login information is not valid.";

"kServiceAuthenticationFailureMsg" = "Try to reconnect to %@.";

"kServiceAgentReturnedErrorTtl" = "The service has encountered an error.";

"kServiceAgentReturnedErrorMsg" = "Try to refresh the view (%@/%@).";

"kServiceAgentMayHaveCrashedMsg" = "“%@” server-side plugin may have unexpectedly quit";

"kServiceGetOrSetStateErrorTtl" = "A service has encountered an error.";

"kServiceGetOrSetStateErrorMsg" = "Try to refresh the view (%@/%@)."; 

"kServiceGetOrSetStateErrorNbMsgPrefix" = "Error: %d";

"kRemoveFromListAlertButton" = "Remove";

"kKeepInListAlertButton" = "Keep in list";

"kKeepDisconnectedInListAlertButton" = "Disconnect";

"kInvalidPeriodTtl" = "Invalid auto-refresh period.";

"kInvalidPeriodMsg" = "The auto-refresh period must be between 1 and 1800 seconds.";

"kInvalidBufSzTtl" = "Invalid buffer size.";

"kInvalidBufSzMsg" = "Buffer size must be between 1024 and 1048576 bytes.";

"kInvalidItemsSelectionTtl" = "You cannot select multiple items for this operation.";

"kInvalidItemsSelectionMsg" = "Please select only one server or service at a time for this operation.";

"kServerAlreadyExistsTtl" = "Server already exists.";

"kServerAlreadyExistsMsg" = "Please log in to a server that is not already in the list. Or use Connect from the action popup below to log in to a disconnected server.";

"kCannotSaveToKeychainTtl" = "Cannot save credentials to default Keychain.";

"kCannotSaveToKeychainMsg" = "Use Keychain Access to investigate the problem.";

"kDismissingUseOfKeychainTtl" = "Automatic login will be disabled.";

"kDismissingUseOfKeychainMsg" = "Saving to the keychain enables automatic login to this server when you launch Server Admin. If you don’t save to the keychain, it will be necessary to select the server and manually reconnect the next time you want to monitor or administer it.";

"kServerDoesNotSupportConfTabViewTtl" = "The %@ view is currently not available.";

"kServerDoesNotSupportConfTabViewMsg" = "Switching to previous available view. This is a one-time alert.";

"kCannotExecuteOSAScriptTtl" = "Cannot execute AppleScript command.";

"kCannotExecuteOSAScriptMsg" = "The target application is not responding.";

"kDeleteItemsAlertTtl" = "Do you really want to remove the selected items?";

"kDeleteGroupAlertTtlFormat" = "Do you really want to remove the group %@?";

"kDeleteServerAlertTtlFormat" = "Do you really want to remove the server %@?";

"kDeleteItemsAlertMsg" = "You cannot undo this action. Hold down the Option key to remove a selection without this warning.";

"kDeleteRecordAlertTtl" = "Are you sure you want to delete the selected record?";

"kDeleteRecordAlertMsg" = "This operation is not undoable.";

"kSaveChangesAlertTtl" = "Save Changes?";

"kSaveChangesBeforeQuittingAlertTtl" = "Save changes before quitting?";

"kSaveChangesAlertMsg" = "Some configuration data needs to be saved. Do you want to save changes now?";

"kCannotProceedFilterWithoutSavingChangesAlertTtl" = "Cannot apply filter.";

"kCannotProceedShortcutWithoutSavingChangesAlertTtl" = "Navigation operation cannot proceed.";

"kCannotHideContentsViewWithoutSavingChangesAlertTtl" = "Cannot show summary view."; /* Deprecated in Leopard */

"kCannotProceedWithoutSavingChangesAlertMsg" = "You must revert or save changes first.";

"kCannotSaveChangesAlertTtl" = "Cannot save changes.";

"kCannotSelectViewAlertTtl" = "Cannot dismiss current view.";

"kCannotLeaveViewAlertTtl" = "Cannot dismiss current view.";

"kInvalidConfigurationDataAlertMsg" = "Some configuration data is invalid: %@.";

"kConfirmSaveChangesAlertTtl" = "Confirm save changes.";

"kConfigurationConfirmationAlertMsg" = "%@";

"kSavingChangesInProgressAlertTtl" = "Save operation in progress.";

"kSavingChangesInProgressAlertMsg" = "Please wait until the save operation completes.";

"kAbortingInProgressAlertTtl" = "Abort operation in progress.";

"kAbortingInProgressAlertMsg" = "Please wait until the abort operation completes.";

"kAbortAlertTtl" = "Abort current operation?";

"kAbortAlertMsg" = "%@";

"kStartNowAlertTtl" = "Start service now?"; /* Added as fix to #3431341 */

"kStopNowAlertTtl" = "Stop service now?";

"kRestartNowAlertTtl" = "Restart service now?";

"kRecycleNowAlertTtl" = "Soft restart service now?";

"kCannotStartNowAlertTtl" = "Cannot start service";

"kStopNowAlertDefaultMsg" = "%@ clients may lose their connection."; /* Added as fix to #3431341 */

"kRestartNowAlertDefaultMsg" = "%@ clients may lose their connection."; /* Added as fix to #3431341 */

"kRecycleNowAlertDefaultMsg" = "%@ clients may lose their connection."; /* Added as fix to #3431341 */

"kFileBrowserNotYetLoadedMsg" = "Remote file browser is not loaded. Please wait a few seconds and try again. If this continues, try to reconnect.";

"kNeedsRestartAlertTtl" = "Do you want to restart %@ now?";

"kNeedsRestartAlertMsg" = "Your changes will take effect the next time you start %@ (%@). If you want them to take effect immediately, you should restart %@ now.";

"kNeedsRecycleAlertTtl" = "Do you want to recycle %@ now?";

"kNeedsRecycleAlertMsg" = "Your changes will take effect the next time you start %@ (%@). If you want them to take effect immediately, you should restart %@ now.";

"kFeatureLockedTtl" = "Editing commands are locked-out.";

"kFeatureLockedMsg" = "You can no longer perform operations that can change the state of your server (such as starting or stopping services, etc.) To unlock those commands select the unlock view menu.";

"kExceptionInAppAlertTtl" = "Uncaught exception raised in application.";

"kExceptionInAppAlertMsg" = "Sorry but the feature you tried to access cannot be used. Exception is:\n\nIn %@: %@ %@ %@.";

"kExceptionInClientPluginAlertTtl" = "Uncaught exception raised in %@ client-side plugin.";

"kExceptionInClientPluginAlertMsg" = "Sorry but the feature you tried to access cannot be used. Exception is:\n\nIn %@: %@ %@ %@.";

"kCrashInClientPluginAlertTtl" = "The application crashed in %@ client-side plugin.";

"kCrashInClientPluginAlertMsg" = "Sorry but the feature you tried to access cannot be used. Please look at Crash Reporter (Console app) as well. Type Command-Option-Escape to Force Quit if clicking Exit does not work. Crash is:\n\nIn %@: %@.";

"kCrashInUnknownLocationAlertTtl" = "The application crashed.";

"kCrashInUnknownLocationAlertMsg" = "Sorry but the feature you tried to access cannot be used. (%@). Please look at Crash Reporter (Console app) as well. Type Command-Option-Escape to Force Quit if clicking Exit does not work.";

"kCannotCreateDuplicateGroupAlertTtl" = "Cannot create group.";

"kCannotEditDuplicateGroupAlertTtl" = "Cannot change group name.";

"kDuplicateGroupAlertTtl" = "That name is already in use.";

"kDuplicateGroupAlertMsgFormat" = "There is already a group named \"%@\". Please use a different name.";

"kEmptyGroupAlertTtl" = "You have attempted to set an empty group name.";

"kEmptyGroupAlertMsg" = "Group names must contain at least one character. Please try again.";

"kErrorInSaveAlertTtl" = "The data could not be saved.";

"kSavePanelTtl" = "Save to a text file";

"kCannotCreateFolderTtl" = "Cannot create folder.";

"kCannotCreateFolderGenericMsg" = "There was a problem creating a new folder.";

"kPortsRestrictedAlertTtl" = "Service port may be restricted.";

"kPortsRestrictedAlertMsg" = "Please check your firewall configuration and make sure all the ports used by %@ are open.";

"kNotImplementedAlertTtl" = "Not implemented.";

"kNotImplementedAlertMsg" = "The feature you are trying to access is not testable at this time.";

"kForceQuitButton" = "Exit";

"kCancelButton" = "Cancel";

"kDeleteButton" = "Remove";

"kSaveButton" = "Save";

"kAbortButton" = "Abort Now";

"kStartNowButton" = "Start Now"; /* Added as fix to #3431341 */

"kStopNowButton" = "Stop Now";

"kRestartNowButton" = "Restart Now";

"kRecycleNowButton" = "Soft Restart Now";

"kSaveMoreButton" = "Save…";

"kDontSaveButton" = "Don’t Save";

"kRestartButton" = "Restart";

"kDontRestartButton" = "Don’t Restart";

"kNoServicesConfiguredTitle" = "This server does not have any services marked as configured.";

"kNoServicesConfiguredMsg" = "Only configured services appear in the server list and server overview. Services can be marked as configured or unconfigured at any time.";

"kConfigureServicesBtn" = "Choose Configured Services";

"kStandardConfigServerAlertTitle" = "Are you sure you want to use Server Admin?";

"kStandardConfigServerAlertMsgFormat" = "The server %@ is a %@ configuration of Mac OS X Server, which is best administered using Server Preferences. You can use Server Admin to customize or add services, but your changes could have unintended effects. Before making changes, carefully note current settings in case you need to revert to them.\r\rAlternatively, you can convert this server to an advanced configuration.";

"kWorkgroupServer" = "workgroup";

"kStandardServer" = "standard";

"kOpenServerPrefsBtn" = "Open Server Preferences";

"kUseServerAdminBtn" = "Use Server Admin";

"kConvertToAdvancedBtn" = "Convert to Advanced";

"kScreenResolutionTooLowTitle" = "Screen resolution too low.";

"kScreenResolutionTooLowMsg" = "Server Admin requires a screen resolution of at least 1024 x 768. This application will now quit.";

"kNotConfigured" = "(Not configured)";

"kNotAuthorized" = "(Not authorized)";

"kBadServerVersion" = "This version of Server Admin is not compatible with this server.";

"kServerVersionTooOld" = "This version of Server Admin can connect to Mac OS X Server v%@ or later. Please update the server '%@' to this version, and then try connecting to it again.";

"kServerVersionTooNew" = "The server %@ is too new (%@) and cannot be administered with this version of Server Admin.";

"kServerVersionMaybeBadTitle" = "Received an unexpected authentication failure.";

"kServerVersionMaybeBadMsg" = "This may be caused by trying to connect to a server prior to version %@. If this is the case, please install the latest update of Mac OS X Server software on '%@' and try to connect again.";

"kNullServerVersion" = "Unable to proceed.";

"kNullServerVersionMsg" = "The server %@ has returned bad version information and can't be administered with Server Admin right now. Please check /var/log/system.log on the server for error messages.";

"kExportPasswordsDontMatchTitle" = "Encryption keys don't match.";

"kExportPasswordsDontMatchMsg" = "Please verify that the key and verification fields have the same value.";

"kImportDecryptionFailedTitle" = "Decryption failed.";

"kImportDecryptionFailedMsg" = "Please be sure that you've entered the correct key to decrypt the selected settings file.";

"kStartServiceBtnShort" = "Start %@";

"kStartServiceBtnLong" = "Start %@ Service";

"kStopServiceBtnShort" = "Stop %@";

"kStopServiceBtnLong" = "Stop %@ Service";

"kUGWindowName" = "Users & Groups";

"kServerPrefsGuardErrorString" = "Changing this setting in Server Admin may interfere with the proper function of a feature in Server Preferences.";

"kServerPrefsGuardDefaultMsgString" = "Please verify that this is really what you intend to do before saving.";

"kInvalidSerialNumberAlert" = "This server's serial number is invalid or has expired.";

"kInvalidSerialNumberAlertMsg" = "Please go to the General tab in Settings to enter a valid serial number.";

/* Service ACL name lookup (shouldn't this be in Server plugin?) */

"com.apple.access_afp" = "AFP";

"com.apple.access_ftp" = "FTP";

"com.apple.access_chat" = "iChat";

"com.apple.access_loginwindow" = "Login Window";

"com.apple.access_mail" = "Mail";

"com.apple.access_pcast" = "Podcast Producer";

"com.apple.access_qtss" = "QTSS";

"com.apple.access_ssh" = "SSH";

"com.apple.access_vpn" = "VPN";

"com.apple.access_web" = "Web";

"com.apple.access_weblog" = "Weblog";

"com.apple.access_smb" = "SMB";

"com.apple.access_xgrid" = "Xgrid";


/* Keychain status messages shown in Login window */

"kKCNoSuchKeychainErr" = "(There is no default Keychain)";

"kKCNoDefaultKeychainErr" = "(There is no default Keychain)";

"kKCInvalidKeychainErr" = "(The default Keychain is invalid)";

"kCannotGetKeychainStatusErr" = "(Cannot obtain the status of the Keychain)";

"kKeychainStatusIsLocked" = "(The Keychain is currently locked)";


/* SSLCertController strings */

"kEditCustomSSLCertificateTooltip" = "Edit or view the custom SSL certificate configuration";  

"kSelectSSLCertificateTooltip" = "Select which SSL certificate to use";

"kNoCertificate" = "No Certificate";

"kCustomConfiguration" = "Custom Configuration…";

"kManageCertificates" = "Manage Certificates…";

"kCertEditImportGenericTitle" = "Choose a file to import.";

"kCertEditImportCertTitle" = "Choose a certificate file to import.";

"kCertEditImportKeyTitle" = "Choose a private key file to import.";

"kCertEditImportChainTitle" = "Choose a certificate chain file to import.";

"kCertificateImportFailed" = "Certificate Import Failed";

"kCertificateImportFailedHint" = "Make sure that the values you entered are correct and that the certificate files on the server are valid.";


/* This seems to be used by Server/ImportCertificateSheet.m and Web/WebConfigurationActions.m */

"OK" = "OK";


/* DirectoryServices most common errors */

"-14079" = "invalid buffer format"; /* eDSInvalidBuffFormat */

"-14090" = "authentication failed"; /* eDSAuthFailed */

"-14096" = "bad password [eDSAuthBadPassword]";

"-14098" = "unknown user [eDSAuthUnknownUser]";

"-14099" = "invalid user name [eDSAuthInvalidUserName]";

"-14120" = "permission error"; /* eDSPermissionError */

"-14134" = "attribute not found"; /* eDSAttributeNotFound*/

"-14135" = "record already exists"; /* eDSRecordAlreadyExists */

"-14136" = "record not found"; /* eDSRecordNotFound */

"-14137" = "attribute not found [eDSAttributeDoesNotExist]";

"-14273" = "unknown plugin [eUnknownPlugIn]";

"-14292" = "not supported by this node [eNotHandledByThisNode]";

/* LogsPanel strings */

"Not available" = "Not available";

/* GraphPanel strings */

"%@ in the past " = "%@ in the past ";

"kFeedbackURL" = "http://www.apple.com/feedback/server.html";

"kDocumentationURL" = "http://www.apple.com/server/documentation";

"kServerSupportURL" = "http://www.apple.com/support/macosxserver";


